openfoam/f1_baseline/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Freestream velocity: 300 km/h = 83.33 m/s (typical F1 straight-line speed)

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (83.33 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (83.33 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    car
    {
        type            noSlip;
    }

    ground
    {
        // Moving ground plane (same speed as freestream to simulate
        // the car moving over stationary ground)
        type            fixedValue;
        value           uniform (83.33 0 0);
    }

    top
    {
        type            symmetryPlane;
    }

    sides
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
