openfoam/f1_baseline/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Specific dissipation rate for k-omega SST
// omega = k / (Cmu * nu_t)
// For external aero: omega ~ k^0.5 / (Cmu^0.25 * L * 0.07)
// With L = 5.64m (car length), omega ~ 100

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 100;
    }

    outlet
    {
        type            zeroGradient;
    }

    car
    {
        type            omegaWallFunction;
        value           uniform 100;
    }

    ground
    {
        type            omegaWallFunction;
        value           uniform 100;
    }

    top
    {
        type            symmetryPlane;
    }

    sides
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
