openfoam/f1_baseline/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// k-omega SST turbulence model
// Recommended for external aerodynamics:
//   - k-omega behavior near walls (boundary layer)
//   - k-epsilon behavior in freestream (wake, separation)
// Validated by Ravelli & Savini (2018) for F1 CFD

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;

    turbulence      on;
    printCoeffs     on;
}

// ************************************************************************* //
