openfoam/f1_baseline/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Mesh refinement for F1 car geometry using snappyHexMesh
// Targets y+ ~ 30-50 for wall functions (k-omega SST)

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    f1_car_combined.stl
    {
        type    triSurfaceMesh;
        name    car;
    }
}

castellatedMeshControls
{
    maxLocalCells       1000000;
    maxGlobalCells      5000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    features
    (
        {
            file        "f1_car_combined.eMesh";
            level       5;      // Fine refinement at edges
        }
    );

    refinementSurfaces
    {
        car
        {
            level       (4 5);  // Min/max surface refinement
            patchInfo
            {
                type    wall;
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        // Near-car refinement box
        // Captures wake, underbody flow, and wing interactions
        refinementBox_near
        {
            mode    inside;
            type    searchableBox;
            min     (-4 -2 0);
            max     (6 2 2);
            level   3;
        }

        // Wake region (extended downstream)
        refinementBox_wake
        {
            mode    inside;
            type    searchableBox;
            min     (3 -1.5 0);
            max     (15 1.5 1.5);
            level   2;
        }

        // Underbody region (critical for ground effect)
        refinementBox_underbody
        {
            mode    inside;
            type    searchableBox;
            min     (-3 -1 0);
            max     (4 1 0.15);
            level   5;      // Extra fine for ground effect
        }

        // Front wing region
        refinementBox_frontwing
        {
            mode    inside;
            type    searchableBox;
            min     (-3.0 -1.2 0);
            max     (-2.0 1.2 0.3);
            level   5;
        }

        // Rear wing + diffuser region
        refinementBox_rearwing
        {
            mode    inside;
            type    searchableBox;
            min     (2.0 -0.8 0);
            max     (3.5 0.8 1.2);
            level   5;
        }
    }

    locationInMesh (0 0 5);     // Point inside the mesh (outside the car)
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      100;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes   true;

    layers
    {
        // Boundary layer on car surface for y+ targeting
        car
        {
            nSurfaceLayers  5;
        }

        // Boundary layer on ground (moving wall)
        ground
        {
            nSurfaceLayers  3;
        }
    }

    expansionRatio      1.3;
    finalLayerThickness 0.5;
    minThickness        0.001;
    nGrow               0;
    featureAngle        130;
    maxFaceThicknessRatio 0.5;
    nSmoothSurfaceNormals 1;
    nSmoothThickness    10;
    nSmoothNormals      3;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle  90;
    nBufferCellsNoExtrude 0;
    nLayerIter          50;
}

meshQualityControls
{
    maxNonOrtho     65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    minVol          1e-13;
    minTetQuality   -1e30;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.02;
    minVolRatio     0.01;
    minTriangleTwist -1;

    nSmoothScale    4;
    errorReduction  0.75;
}

// ************************************************************************* //
